Revit 2024 API
BuiltInFailures.SteelElementsFailures.SteelElementInvisibleInCurrentLevelOfDetailWarn Property
 The created elements are only visible in Detail Level: Fine.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementInvisibleInCurrentLevelOfDetailWarn { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementInvisibleInCurrentLevelOfDetailWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementInvisibleInCurrentLevelOfDetailWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementsFailures Class
Autodesk.Revit.DB Namespace